## terraform plan
```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.s3Bucket has been deleted
-   resource "aws_s3_bucket" "s3Bucket" {
-       acl                         = "public-read" -> null
-       arn                         = "arn:aws:s3:::acme-test-application" -> null
-       bucket                      = "acme-test-application" -> null
-       bucket_domain_name          = "acme-test-application.s3.amazonaws.com" -> null
-       bucket_regional_domain_name = "acme-test-application.s3.us-west-2.amazonaws.com" -> null
-       force_destroy               = false -> null
-       hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
-       id                          = "acme-test-application" -> null
-       policy                      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "s3:GetObject",
                        ]
-                       Effect    = "Allow"
-                       Principal = "*"
-                       Resource  = "arn:aws:s3:::acme-test-application/*"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       region                      = "us-west-2" -> null
-       request_payer               = "BucketOwner" -> null
-       tags_all                    = {} -> null
-       website_domain              = "s3-website-us-west-2.amazonaws.com" -> null
-       website_endpoint            = "acme-test-application.s3-website-us-west-2.amazonaws.com" -> null

-       versioning {
-           enabled    = false -> null
-           mfa_delete = false -> null
        }

-       website {
-           index_document = "index.html" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = "private"
+       arn                         = (known after apply)
+       bucket                      = "acme-test-application-bucket"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
+   resource "aws_s3_bucket_public_access_block" "this" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```